### Terraform `plan` Succeeded for Workspace: `testing`
<details><summary>Show Output</summary>

```diff
[command]/home/runner/work/_temp/f263be63-0b7e-409b-94d8-678062bf2600/terraform-bin plan -var-file=vars/test.tfvars -var-file=vars/test-vpc.tfvars -var-file=vars/test.tfvars -lock=false -input=false
random_pet.test: Refreshing state... [id=test]
data.github_team.owner: Reading...
data.aws_test_cluster.selected: Reading...
aws_secretsmanager_secret.gh_read_token[0]: Refreshing state... [id=arn:aws:secretsmanager:test_region:test_account_2:secret:test_secret_4]
aws_secretsmanager_secret.gh_ssh_key[0]: Refreshing state... [id=arn:aws:secretsmanager:test_region:test_account_2:secret:github-ssh-key-ydaDx6]
module.test[0].module.kms.data.aws_partition.current: Reading...
aws_secretsmanager_secret.artifactory[0]: Refreshing state... [id=arn:aws:secretsmanager:test_region:test_account_2:secret:test_secret_3]
module.test[0].module.kms.data.aws_caller_identity.current: Reading...
module.test_vpc.data.aws_vpc_endpoint_service.dynamodb[0]: Reading...
module.test[0].module.kms.data.aws_partition.current: Read complete after 0s [id=aws]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # aws_s3_bucket.test will be created
+   resource "aws_s3_bucket" "test" {
+       acceleration_status         = (known after apply)
+       acl                         = (known after apply)
+       arn                         = (known after apply)
+       bucket                      = "my-tf-test-bucket"
+       bucket_domain_name          = (known after apply)
+       bucket_prefix               = (known after apply)
+       bucket_regional_domain_name = (known after apply)
+       force_destroy               = false
+       hosted_zone_id              = (known after apply)
+       id                          = (known after apply)
+       object_lock_enabled         = (known after apply)
+       policy                      = (known after apply)
+       region                      = (known after apply)
+       request_payer               = (known after apply)
+       tags_all                    = (known after apply)
+       website_domain              = (known after apply)
+       website_endpoint            = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```
</details>